export const filterOptions = {
    'دوربین':{
        'properties.محدوده دقت حسگر': [
            "15.0 تا 20.0 مگاپیکسل"
            ,"12.0 تا 15.0 مگاپیکسل"
            ," 10.0 مگاپیکسل"
            ,"20.0 مگاپیکسل و بیشتر"
            ,"20.0 مگاپیکسل"
            ,"10.0 تا 12.0 مگاپیکسل"
            ,"21.14 مگاپیکسل"
        ],
        'properties.محدوده زوم': [
            "6 تا 10 برابر بزرگنمایی"
            ,"4 برابر بزرگنمایی اپتیکال"
            ,"3 برابر بزرگنمایی اپتیکال"
            ,"50 برابر بزرگنمایی و بیشتر"
            ,"3 تا 6 برابر بزرگنمایی"
            ,"تا 3 برابر بزرگنمایی"
            ,"10 تا 15 برابر بزرگنمایی"
            ,"20 تا 30 برابر بزرگنمایی"
            ,"30 برابر بزرگنمایی"
            ," تا 3 برابر بزرگنمایی",
        ],
        'properties.رزولوشن فیلم': [
            "4K",
            "Full HD",
            "HD",
            "فاقد قابلیت فیلمبرداری ",
        ],
        'properties.نوع': [
            "DSLR",
            "کامپکت",
            "بدون آینه"
        ],
        "properties.قطع حسگر": [
            "Full Frame",
            "Crop Frame"
        ]
    },
    "گوشی موبایل": {
        'properties.سیستم عامل': [
            "android",
            "ios"
        ],   
        "properties.رزولوشن عکس": [
            "12 مگاپیکسل",
            "16 مگاپیکسل",
            "48 مگاپیکسل",
            "64 مگاپیکسل",
        ],
        "properties.دوربین های پشت گوشی": [
            "4 ماژول دوربین",
            "3 ماژول دوربین",
            "2 ماژول دوربین",
            "1 ماژول دوربین",
        ],
        "properties.حافظه داخلی": [
            '1 ترابایت',
            '512 گیگابایت',
            '256 گیگابایت',
            '128 گیگابایت',
            '64 گیگابایت',
            '32 گیگابایت',
            '16 گیگابایت',
            '8 گیگابایت',
            '4 گیگابایت',
        ],
        "properties.مقدار RAM": [
            '16 گیگابایت',
            '12 گیگابایت',
            '8 گیگابایت',
            '6 گیگابایت',
            '4 گیگابایت',
            '2 گیگابایت',
        ]
    },
    "لپ تاپ": {
        'properties.سیستم عامل': [
            "Microsoft Windows 10",
            "بدون سیستم عامل",
            "Apple Mac OS"
        ],
        "properties.نوع": [
            "نوت بوک (لپ تاپ)",
            "آلترابوک",
            "نت بوک",
            "کروم بوک"
        ],
        "properties.ظرفیت حافظه RAM": [
            '64 گیگابایت',
            '32 گیگابایت',
            '16 گیگابایت',
            '12 گیگابایت',
            '8 گیگابایت',
            '4 گیگابایت',
            '2 گیگابایت',
        ],
        "properties.نوع حافظه RAM": [
            "DDR4",
            "DDR3",
            "DDR2",
            "Unified",
            "LPDDR4X",
            "LPDDR4",
            "LPDDR3"
        ],
        "properties.ظرفیت حافظه داخلی": [
            '2 ترابایت',
            '1 ترابایت',
            '512 گیگابایت',
            '256 گیگابایت',
            '128 گیگابایت',
        ],
        "properties.سری پردازنده": [
            "M1",
            "core i9",
            "core i7",
            "core i5",
            "core i3",
            "Ryzen 7",
            "Ryzen 5",
            "Ryzen 3",
            "pentium",
            "celereon"
        ],
        "properties.سازنده پردازنده گرافیکی":[
            "NVIDIA",
            "Intel",
            "Apple",
            "AMD",
            "AIT",
            "Rockchip"
        ],
        
    }
}
// export const filterOptions = {
//     'دوربین':{
//         'محدوده دقت حسگر': [
//             "15.0 تا 20.0 مگاپیکسل"
//             ,"12.0 تا 15.0 مگاپیکسل"
//             ," 10.0 مگاپیکسل"
//             ,"20 مگاپیکسل وبیشتر"
//             ,"20.0 مگاپیکسل"
//             ,"10.0 تا 12.0 مگاپیکسل"
//             ,"21.14 مگاپیکسل"
//         ],
//         'محدوده زوم': [
//             "6 تا 10 برابر بزرگنمایی"
//             ,"4 برابر بزرگنمایی اپتیکال"
//             ,"3 برابر بزرگنمایی اپتیکال"
//             ,"50 برابر بزرگنمایی و بیشتر"
//             ,"3 تا 6 برابر بزرگنمایی"
//             ,"تا 3 برابر بزرگنمایی"
//             ,"10 تا 15 برابر بزرگنمایی"
//             ,"20 تا 30 برابر بزرگنمایی"
//             ,"30 برابر بزرگنمایی"
//             ," تا 3 برابر بزرگنمایی",
//         ],
//         'رزولوشن فیلم': [
//             "4K",
//             "Full HD",
//             "HD",
//             "فاقد قابلیت فیلمبرداری ",
//         ],
//         'نوع': [
//             "DSLR",
//             "کامپکت",
//             "بدون آینه"
//         ],
//         "قطع حسگر": [
//             "Full Frame",
//             "Crop Frame"
//         ]
//     },
//     "گوشی موبایل": {
//         'سیستم عامل': [
//             "android",
//             "ios"
//         ],   
//         "رزولوشن عکس": [
//             "12 مگاپیکسل",
//             "16 مگاپیکسل",
//             "48 مگاپیکسل",
//             "64 مگاپیکسل",
//         ],
//         "دوربین های پشت گوشی": [
//             "4 ماژول دوربین",
//             "3 ماژول دوربین",
//             "2 ماژول دوربین",
//             "1 ماژول دوربین",
//         ],
//         "حافظه داخلی": [
//             '1 ترابایت',
//             '512 گیگابایت',
//             '256 گیگابایت',
//             '128 گیگابایت',
//             '64 گیگابایت',
//             '32 گیگابایت',
//             '16 گیگابایت',
//             '8 گیگابایت',
//             '4 گیگابایت',
//         ],
//         "مقدار RAM": [
//             '16 گیگابایت',
//             '12 گیگابایت',
//             '8 گیگابایت',
//             '6 گیگابایت',
//             '4 گیگابایت',
//             '2 گیگابایت',
//         ]
//     },
//     "لپ تاپ": {
//         'ُسیستم عامل': [
//             "Microsoft Windows 10",
//             "بدون سیستم عامل",
//             "Apple Mac OS"
//         ],
//         "نوع": [
//             "نوت بوک (لپ تاپ)",
//             "آلترابوک",
//             "نت بوک",
//             "کروم بوک"
//         ],
//         "ظرفیت حافظه RAM": [
//             '64 گیگابایت',
//             '32 گیگابایت',
//             '16 گیگابایت',
//             '12 گیگابایت',
//             '8 گیگابایت',
//             '4 گیگابایت',
//             '2 گیگابایت',
//         ],
//         "نوع حافظه RAM": [
//             "DDR4",
//             "DDR3",
//             "DDR2",
//             "Unified",
//             "LPDDR4X",
//             "LPDDR4",
//             "LPDDR3"
//         ],
//         "ظرفیت حافظه داخلی": [
//             '2 ترابایت',
//             '1 ترابایت',
//             '512 گیگابایت',
//             '256 گیگابایت',
//             '128 گیگابایت',
//         ],
//         "سری پردازنده": [
//             "M1",
//             "core i9",
//             "core i7",
//             "core i5",
//             "core i3",
//             "Ryzen 7",
//             "Ryzen 5",
//             "Ryzen 3",
//             "pentium",
//             "celereon"
//         ],
//         "سازنده پردازنده گرافیکی":[
//             "NVIDIA",
//             "Intel",
//             "Apple",
//             "AMD",
//             "AIT",
//             "Rockchip"
//         ],
        
//     }
// }